20220111213141-design_by_manipulating_mock_code.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-16 Tue 18:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Design by manipulating mock code</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Design by manipulating mock code</h1>
<p>
You should build API writing mock code, and manipulate said code <a href="20220111192254-an_api_is_good_when_you_do_not_think_about_it.html#ID-1eb7d036-0133-496e-97de-ae4b92793b89">until it feels natural</a>. When you don't have the contraints of the backend is when you can really be creative. Start from first principle and then elaborate. I can spend <b>weeks</b> going over and over details of API. And you should because <a href="20220111214711-every_improvement_you_make_to_an_api_pays_huge_dividends.html#ID-480c37d9-30c1-40e1-8813-f09926d0b066">every improvement you make to an API pays huge dividends</a>.
</p>

<p>
Doing so you should <a href="20220111215854-constantly_share_progress_on_your_api_code.html#ID-3a864fde-3ee3-4372-9a7f-44317aac67ba">Constantly share progress on your API code</a>
</p>

<p>
Let us take the case of <a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/aesara-devs/aesara">aesara</a> and the looping primitive, <code>Scan</code>. The basic building block of <code>aesara</code> is the Op: an object that transforms variables into other variables. While it is tempting to copy <a target='_blank' rel='noopener noreferrer' class='external' href="https://jax.readthedocs.io/en/latest/notebooks/Common_Gotchas_in_JAX.html#while-loop">JAX's interface</a> we still want to make the Ops salient. So without worrying a second about how things were going to be implemented I just worried about <i>what we would like to have</i> and ended with:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara

<span style="font-weight: bold; font-style: italic;">loop</span> = aesara.while_loop(cond_fn, body_fn)
<span style="font-weight: bold; font-style: italic;">last_value</span>, <span style="font-weight: bold; font-style: italic;">acc</span> = loop(initial_value)

<span style="font-weight: bold; font-style: italic;">scan</span> = aesara.scan(body_fn)
<span style="font-weight: bold; font-style: italic;">last_value</span>, <span style="font-weight: bold; font-style: italic;">acc</span> = scan(initial_val, sequence)
</pre>
</div>

<p>
This should be done at the same time as <a href="20220111192552-implement_what_is_conceptually_correct.html#ID-39703634-2e4c-4dea-be05-20d75bf6466a">implementing what is conceptually correct</a>.
</p>

<div id="outline-container-org92cd2df" class="outline-2">
<h2 id="org92cd2df">Links to this note</h2>
</div>
</div>
</body>
</html>
